app/Controllers/Dashboard.php

SELECT *
FROM `notifications`
SELECT COUNT(*) AS `numrows` FROM `pendaftaran_anggota`
SELECT COUNT(*) AS `numrows`
FROM `bukti_pembayaran`
WHERE `status` = 'sudah_verifikasi'
SELECT COUNT(*) AS `numrows`
FROM `bukti_pembayaran`
WHERE `status` = 'sedang_verifikasi'
SELECT COUNT(*) AS `numrows`
FROM `bukti_pembayaran`
WHERE `status` = 'belum_valid'
SELECT COUNT(*) AS `numrows`
FROM `bukti_pembayaran`
WHERE `bukti_pembayaran` IS NOT NULL
---
    public function index()
    {
        // Ambil notifikasi terbaru
        $notifications = $this->NotificationModel->findAll();

        $data = [
            'judul' => 'Dashboard',
            'page' => 'dashboard',
            'menu' => 'dashboard',
            'submenu' => '',
            'total_pendaftar' => $this->PendaftaranAnggotaModel->countAll(),
            'total_sudah_verifikasi' => $this->BuktiPembayaranModel->where('status', 'sudah_verifikasi')->countAllResults(),
            'total_sedang_verifikasi' => $this->BuktiPembayaranModel->where('status', 'sedang_verifikasi')->countAllResults(),
            'total_belum_verifikasi' => $this->BuktiPembayaranModel->where('status', 'belum_valid')->countAllResults(),
            'total_pembayaran' => $this->BuktiPembayaranModel->where('bukti_pembayaran !=', null)->countAllResults(),