app/Controllers/PendaftaranAnggota.php

INSERT INTO `pendaftaran_anggota` (`package_name`, `package_price`, `nama_lengkap`, `email`, `nomor_hp`, `domisili`, `perusahaan`, `jabatan`, `alamat_perusahaan`, `id_type`, `nomor_id`, `gender`, `payment_method`) VALUES ('Paket Menengah', '2500000', 'Cindy Intania', 'cindy@gmail.com', '0897658990', 'Bekasi', 'PT.KLMN', 'Staff', 'Jakarta', 'ktp', '45678', 'perempuan', 'transfer')
INSERT INTO `bukti_pembayaran` (`pendaftaran_id`, `nama`, `email`, `nomor_hp`, `payment_method`, `status`, `package_name`, `package_price`) VALUES (93, 'Cindy Intania', 'cindy@gmail.com', '0897658990', 'transfer', 'sedang_verifikasi', 'Paket Menengah', '2500000')
---


        $model = new PendaftaranAnggotaModel();
        if ($model->save($data)) {
            $lastInsertId = $model->insertID();

            $buktiPembayaranModel = new BuktiPembayaranModel();
            $buktiPembayaranModel->save([
                'pendaftaran_id' => $lastInsertId,
                'nama' => $data['nama_lengkap'],
                'email' => $data['email'],
                'nomor_hp' => $data['nomor_hp'],
                'payment_method' => $data['payment_method'], // Tambahkan ini
                'status' => 'sedang_verifikasi',
                'package_name' => $data['package_name'], // Tambahkan ini
                'package_price' => $data['package_price'], // Tambahkan ini
            ]);

SELECT *
FROM `pendaftaran_anggota`
WHERE `pendaftaran_anggota`.`id` = '93'
---
    public function uploadBukti($pendaftaran_id)
    {
        $model = new PendaftaranAnggotaModel();
        $dataPendaftaran = $model->find($pendaftaran_id);

SELECT *
FROM `penilaian`
---
    public function riwayatPembelian()
    {
        $PenilaianModel = new PenilaianModel();
        $userData = session()->get();
        if (!isset($userData['logged_in']) || !$userData['logged_in']) {
            return redirect()->to('/login');
        }

        $email = session()->get('email'); // Pastikan email session sudah benar

        $buktiPembayaranModel = new BuktiPembayaranModel();
        $riwayatSedangVerifikasi = $buktiPembayaranModel->getRiwayatByEmail($email, 'sedang_verifikasi');
        $riwayatSudahVerifikasi = $buktiPembayaranModel->getRiwayatByEmail($email, 'sudah_verifikasi');
        $riwayatBelumValid = $buktiPembayaranModel->getRiwayatByEmail($email, 'belum_valid');
        $data = [
            'title' => 'Riwayat Pembelian',
            'riwayatSedangVerifikasi' => $riwayatSedangVerifikasi,
            'riwayatSudahVerifikasi' => $riwayatSudahVerifikasi,
            'riwayatBelumValid' => $riwayatBelumValid,
        ];

        $data['penilaian'] = $PenilaianModel->findAll(); // Ambil semua penilaian

SELECT *
FROM `pendaftaran_anggota`
WHERE `pendaftaran_anggota`.`id` = '93'
SELECT *
FROM `bukti_pembayaran`
WHERE `pendaftaran_id` = '93'
 LIMIT 1
---
    public function detailRiwayat($pendaftaran_id)
    {
        $pendaftaranModel = new PendaftaranAnggotaModel();
        $buktiPembayaranModel = new BuktiPembayaranModel();

        $dataPendaftaran = $pendaftaranModel->find($pendaftaran_id);
        $buktiPembayaran = $buktiPembayaranModel->where('pendaftaran_id', $pendaftaran_id)->first();

SELECT *
FROM `pendaftaran_anggota`
---
    public function daftar()
    {
        $model = new PendaftaranAnggotaModel();
        $dataPendaftaran = $model->findAll(); // Ambil semua data dari tabel pendaftaran

SELECT *
FROM `pendaftaran_anggota`
WHERE `pendaftaran_anggota`.`id` = '85'
DELETE FROM `pendaftaran_anggota`
WHERE `id` IN ('85')
---
    public function hapus($id)
    {
        $model = new PendaftaranAnggotaModel();
        $pendaftaran = $model->find($id);

        if (!$pendaftaran) {
            return redirect()->to('/pendaftaran/daftar')->with('gagal', 'Data tidak ditemukan.');
        }

        $model->delete($id);

SELECT *
FROM `bukti_pembayaran`
---
    public function daftarPembayaran()
    {
        $model = new BuktiPembayaranModel();
        $data['pembayaran'] = $model->findAll(); // Mengambil semua riwayat pembayaran

SELECT *
FROM `bukti_pembayaran`
---
    public function riwayat()
    {
        $data = [
            'title' => 'Riwayat Pembelian',
            'riwayat' => $this->buktiPembayaranModel->findAll() // Ambil semua data pembelian

UPDATE `bukti_pembayaran` SET `status` = 'sudah_verifikasi'
WHERE `bukti_pembayaran`.`id` IN ('103')
---
    public function updateStatus($id)
    {
        $status = $this->request->getPost('status'); // Ambil status dari dropdown
        $this->buktiPembayaranModel->update($id, ['status' => $status]);

SELECT *
FROM `penilaian`
---
    public function listPenilaian()
    {
        $penilaianModel = new PenilaianModel();
        $data['penilaian'] = $penilaianModel->findAll();