app/Controllers/User.php

SELECT *
FROM `user`
WHERE `email` = 'avitaa@gmail.com'
 LIMIT 1
---
    public function loginProcess()
    {
        $userData = new M_User(); // Model user
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $userData->where('email', $email)->first();

SELECT *
FROM `user`
---
    public function listUsers()
    {
        $model = new M_User();

        // Ambil semua data dari tabel user
        $data = [
            'judul' => 'Daftar User',
            'menu' => 'masterdata',
            'submenu' => 'user',
            'users' => $model->findAll() // Ambil data user

DELETE FROM `user`
WHERE `id` IN ('34')
---
    public function deleteUser($id = null)
    {
        if (!$id) {
            return redirect()->to('/admin/user')->with('error', 'ID pengguna tidak ditemukan.');
        }

        $model = new M_User();

        if ($model->delete($id)) {