app/Models/BuktiPembayaranModel.php

    public function getRiwayatByEmail($email, $status = null)
    {
        $builder = $this->db->table($this->table);
        $builder->where('email', $email);

        if ($status !== null) {
            $builder->where('status', $status);
        }

        return $builder->get()->getResult();  // Menjalankan query dan mengembalikan hasilnya
---
SELECT *
FROM `bukti_pembayaran`
WHERE `email` = 'cindy@gmail.com'
AND `status` = 'sedang_verifikasi'