app/Models/PenilaianModel.php

    public function getAllPenilaian()
    {
        return $this->select('penilaian.*, pendaftaran_anggota.package_name, user.fullname')
            ->join('pendaftaran_anggota', 'pendaftaran_anggota.id = penilaian.pendaftaran_id')
            ->join('user', 'user.email = pendaftaran_anggota.email', 'left') // Ubah 'user.id' sesuai kondisi
            ->orderBy('penilaian.created_at', 'DESC')
            ->findAll();
---
SELECT `penilaian`.*, `pendaftaran_anggota`.`package_name`, `user`.`fullname`
FROM `penilaian`
JOIN `pendaftaran_anggota` ON `pendaftaran_anggota`.`id` = `penilaian`.`pendaftaran_id`
LEFT JOIN `user` ON `user`.`email` = `pendaftaran_anggota`.`email`
ORDER BY `penilaian`.`created_at` DESC